## Final Project: NFT Database Management System

###  Madeline Odom
#### CSPB 3287
#### Spring 2022

## Project Overview

Recently, NFTs have exploded in popularity and potential purchasers may wonder if they are worth the investment. For my project, I built a NFT Database Management System so potential investors can review NFT data to learn about NFT artwork on the market.  This includes ownership information including mint and transfers, art and collection relationships, and financial data.  By providing a NFT Database Management System, potential NFT investors can learn about the collections, transactions, and gain valuable insight regarding financial data.

### Data Management

The data used in this project is a mix of Kaggle data (https://www.kaggle.com/hemil26/nft-collections-dataset) and randomized data. All of the data sourced is compiled into csv files and included in the source folder. The data used was directly uploaded to the MySQL database hosted by db4free.net via myphpadmin. All queries, table creation, and database updates are included in this Jupyter Notebook.

Both of these platforms were chosen because of they provide seamless integration and are very accessible. Additionally, the Jupyter Notebook used here is a great way to perform queries while effectively presenting the data. Overall, the use of the MySQL database and Jupyter Notebook provide a user-friendly way to query, update, and manage data.

### Learning Outcomes
I utilize data from Kaggle and randomized data to create a cohesive, organized database management system for NFT data.

My goal is to create a system that establishes relations between various sources, and can be used to help potential investors learn more about the NFT market. By utilizing various queries, users can see how all of the data relates to one another and they can learn more about the current market.

Additionally, I implemented constraints and triggers to ensure that this system is easy to maintain and update, and is well organized.

### Recorded Presentation

https://youtu.be/JvWqmJ-S9go

## NFT Database Management System

#### E/R Diagram

This E/R Diagram contains only the attributes that are keys. Additional attributes are included in the tables created in the following section.

- There must be one piece of artwork per collection, but a collection can have many pieces of artwork.
- Artwork cannot exist without a collection. NFT Art and Pieces both contain NFT artwork information and must belong to a collection.
- Ownership has a one to one with a collection.  This is either represented in a transfer or a mint transaction.

![ER Diagram](erdiagram.png)

#### Import & Configuration

In [1]:
import os
import configparser
import pandas as pd
from sqlalchemy import create_engine

mycfg = configparser.ConfigParser()
mycfg.read("/home/jovyan/mysql.cfg")
print(f"User    : [{mycfg['mysql']['user']}]")
database = mycfg['mysql']['url'].split('@')[1]  # leave off the password
print(f"Database: [[mysql://{mycfg['mysql']['user']}...@{database}]")

db_url = mycfg['mysql']['url'] 
os.environ['DATABASE_URL'] = db_url

User    : [maod6844]
Database: [[mysql://maod6844...@applied-sql.cs.colorado.edu:3306/maod6844]

In [2]:
%reload_ext sql
print ("get version...")
%sql SELECT version()

get version...
1 rows affected.

[('8.0.27',)]

#### Create the Tables

There are 5 tables created to include all of the data.  The tables include the Collection information (project_collection), Artwork information (project_nftArt and project_pieces), and Ownership information (project_transfers and project_mints).

In [8]:
%%sql

create table project_collection(
    addId     int primary key,
    name      varChar(255)
);

create table project_pieces(
    pId         int primary key,
    aId         int,
    collection  varChar(255),
    piece       varChar(255),
    foreign key(aId) references project_collection(addId) ON DELETE CASCADE
);

create table project_nftArt(
    aId          int primary key,
    cId          int,
    collection   varChar(255),
    sales        varChar(255),
    buyers       int,
    transactions int,
    owners       int,
    foreign key(cId) references project_collection(addId) ON DELETE CASCADE
);

create table project_mints(
    event_id         int primary key,
    Transaction_hash int,
    nft_id           int,
    From_address     int,
    To_address       int,
    Transaction_value int,
    foreign key(nft_id) references project_collection(addId) ON DELETE CASCADE
);

create table project_transfers(
    event_id         int primary key,
    Transaction_hash int,
    nft_id           int,
    From_address     int,
    To_address       int,
    Transaction_value int,
    foreign key(nft_id) references project_collection(addId) ON DELETE CASCADE
);

 * mysql://maod6844:***@applied-sql.cs.colorado.edu:3306/maod6844
(MySQLdb._exceptions.OperationalError) (1050, "Table 'project_collection' already exists")
[SQL: create table project_collection(
    addId     int primary key,
    name      varChar(255)
);]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

#### Populate the Tables

The NFT data used for this project consists of a mix of real data collected from Kaggle (https://www.kaggle.com/hemil26/nft-collections-dataset) and randomized data.

All csv files are located in the Source folder and were loaded directly into myphpadmin to populate the tables.

In [9]:
%%sql
SELECT * from project_collection
limit 5;

 * mysql://maod6844:***@applied-sql.cs.colorado.edu:3306/maod6844
5 rows affected.

[(1001, '0N1 Force'),
 (1002, '0xVampire'),
 (1003, '888 Inner Circle'),
 (1004, 'Adam Bomb Squad'),
 (1005, 'Al Cabones')]

In [10]:
%%sql
SELECT aId, collection, sales, buyers, transactions, owners from project_nftArt
limit 5;

 * mysql://maod6844:***@applied-sql.cs.colorado.edu:3306/maod6844
5 rows affected.

[(1, '0N1 Force', '147262453', 6917, 15982, 4217),
 (2, '0xVampire', '8343143', 6105, 13396, 4281),
 (3, '888 Inner Circle', '49408610', 5040, 9423, 1),
 (4, 'Adam Bomb Squad', '40193328', 8774, 23440, 7958),
 (5, 'Al Cabones', '2956652', 1520, 4243, 3635)]

In [11]:
%%sql
SELECT * from project_mints
limit 5;

 * mysql://maod6844:***@applied-sql.cs.colorado.edu:3306/maod6844
5 rows affected.

[(4010, 300, 1001, 0, 1214, 63922),
 (4011, 301, 1002, 0, 1215, 52989),
 (4012, 302, 1003, 0, 1216, 73485),
 (4013, 303, 1004, 0, 1217, 95808),
 (4014, 304, 1005, 0, 1218, 9725)]

In [12]:
%%sql
SELECT * from project_transfers
limit 5;

 * mysql://maod6844:***@applied-sql.cs.colorado.edu:3306/maod6844
5 rows affected.

[(6000, 500, 1250, 1214, 1428, 3651),
 (6001, 501, 1249, 1215, 1381, 276764),
 (6002, 502, 1248, 1216, 1479, 460583),
 (6003, 503, 1247, 1217, 1304, 144069),
 (6004, 504, 1246, 1218, 1557, 865361)]

In [13]:
%%sql
SELECT * from project_pieces
limit 5;

 * mysql://maod6844:***@applied-sql.cs.colorado.edu:3306/maod6844
5 rows affected.

[(1, 1001, '0N1 Force', 'name'),
 (2, 1002, '0xVampire', 'Giant Frog'),
 (3, 1003, '888 Inner Circle', 'Biospecimens'),
 (4, 1004, 'Adam Bomb Squad', 'long legs'),
 (5, 1005, 'Al Cabones', 'A Guide in my Dreams')]

### Queries

Below are several queries to show relationships among the tables.

#### Query to show the count of art pieces per art collection.

In [14]:
%%sql
SELECT collection as "Collection", count(*) as "Number of Pieces per Collection"
from project_pieces 
GROUP BY collection
ORDER BY count(*) DESC
limit 15;

 * mysql://maod6844:***@applied-sql.cs.colorado.edu:3306/maod6844
15 rows affected.

[('Lonely Alien Space Club', 17),
 ('Bunks', 7),
 ('Green Rabbit', 7),
 ('Fluffy Polar Bears', 7),
 ('Fancy Frenchies', 5),
 ('BYOKEY', 5),
 ('Evolution', 5),
 ('Al Cabones', 5),
 ('Colonize Mars', 5),
 ('Avid Lines', 5),
 ('Frontier Game', 5),
 ('Block Art', 5),
 ('Animetas', 4),
 ('Autoglyphs', 4),
 ('Crypto Beasts', 4)]

#### Query to show the names of every art piece in the collection.

In [15]:
%%sql
SELECT collection as "Collection", GROUP_CONCAT(piece) as Pieces, count(*) as "Number of Pieces per Collection"
from project_pieces
GROUP BY collection
ORDER BY count(*) DESC
limit 5;

 * mysql://maod6844:***@applied-sql.cs.colorado.edu:3306/maod6844
5 rows affected.

[('Lonely Alien Space Club', 'Antarctica ?,Strong emotions ,The chica of the green sweater,Man,Wolf character ??,Photographer on the hunt ?,The woman in the shadows ?,Cutie babe,S ... (43 characters truncated) ... er ,The Sphinx loves gum,? Black Square" by Daria Yakubenko ? From Malevich\'s idea",Black Panther,changing colors ,emmeline in space,The Hive Tester', 17),
 ('Bunks', "Arancia,Quiet Inlet,Footballer,'Bailarina de flamenco: ilustración acrílica 8''10'',Warmth of A Friendly Face,1,Grow", 7),
 ('Green Rabbit', 'No regrets,Dark Creatures,DECIMATED ,Amelia,The Raijin,The Noh,Green Glob', 7),
 ('Fluffy Polar Bears', 'The Mischief Maker,Critrembyte,Ten Freaky Faces1,A Window,Dunes,Be Happy!,Dreaming', 7),
 ('Avid Lines', 'The Wild One.,Fragile,PENELOPE,Sialia,BIRDUANA', 5)]

#### Query to combine nftArtProject and eftNftCollectionProject tables using joins.

In [16]:
%%sql
SELECT collection as "Collection", sales as "Total Sales", buyers as Buyers, transactions as Transactions, owners as "Number of Owners"
from project_nftArt as a, project_collection as c
where a.cId = c.addId
ORDER BY a.owners DESC
limit 5;

 * mysql://maod6844:***@applied-sql.cs.colorado.edu:3306/maod6844
5 rows affected.

[('Axie Infinity', '3328148500', 1079811, 9755511, 2656431),
 ('Alien Worlds', '33282729', 405975, 4630191, 2562646),
 ('NBA Top Shot', '781965423', 374818, 11790699, 603928),
 ('CryptoKitties', '45790208', 111129, 786656, 109858),
 ('Sorare', '129615752', 42675, 713122, 60277)]

#### Query to show the value for when the art piece was first minted.

In [19]:
%%sql
SELECT collection as "Collection", sales as "Total Sales", transactions as Transactions, Transaction_value as "Mint Value"
from project_nftArt as a, project_collection as c, project_mints as m
where a.cId = c.addId and m.nft_id = c.addId
ORDER BY Transaction_value DESC
limit 5;

 * mysql://maod6844:***@applied-sql.cs.colorado.edu:3306/maod6844
5 rows affected.

[('Avid Lines', '14398302', 469, 99619),
 ('Veefriends', '96224091', 2940, 99324),
 ('SolPunks', '32952969', 14399, 99216),
 ('Crypto Zunks', '2993628', 7207, 99211),
 ('MetaHero Universe DAO Tokens', '9006014', 2382, 98998)]

#### Query to show the value of the most recent transaction.

In [20]:
%%sql
SELECT collection as "Collection", sales as "Total Sales", transactions as "Total Transactions", Transaction_value as "Most Recent Transaction Value"
from project_nftArt as a, project_collection as c, project_transfers as t
where a.cId = c.addId and t.nft_id = c.addId
ORDER BY Transaction_value DESC
limit 5;

 * mysql://maod6844:***@applied-sql.cs.colorado.edu:3306/maod6844
5 rows affected.

[('Piggy Sol Gang', '7217495', 10104, 993383),
 ('Loot', '264652035', 9997, 989195),
 ('F1 Delta Time', '6659338', 8050, 984920),
 ('Solana Monkey Business', '111321313', 6727, 979360),
 ('SolChicks', '3850851', 4523, 971806)]

#### Query to show groups based on Transaction IDs.

Reveals the total sales by groups of transactions.

In [21]:
%%sql
SELECT collection as "Collection", Transaction_hash as "Transaction ID", sales as "Total Sales"
from project_nftArt as a, project_collection as c, project_transfers as t
where a.cId = c.addId and t.nft_id = c.addId
GROUP by Transaction_hash, sales, collection
ORDER BY CAST(sales as DECIMAL) DESC
limit 10;

 * mysql://maod6844:***@applied-sql.cs.colorado.edu:3306/maod6844
10 rows affected.

[('Axie Infinity', 734, '3328148500'),
 ('CryptoPunks', 690, '1664246968'),
 ('Art Blocks', 739, '1075223906'),
 ('Bored Ape Yacht Club', 721, '783882186'),
 ('NBA Top Shot', 599, '781965423'),
 ('Mutant Ape Yacht Club', 603, '422429206'),
 ('Loot', 615, '264652035'),
 ('Meebits', 613, '237519388'),
 ('Cool Cats', 706, '186937798'),
 ('CrypToadz', 696, '170407439')]

#### Query to show the initial transfers after a piece was minted (the first transfer).

In [ ]:
%%sql
SELECT Art.collection as Collection, Mint.from_address as "Minted Piece", Mint.to_address as "First Transfer After Mint", Transfer.to_address as "Additional Transfer"
from project_transfers as Transfer, project_mints as Mint, project_nftArt as Art
where Mint.to_address = Transfer.from_address and Art.cId = Transfer.nft_id
limit 10;

 * mysql://maod6844:***@applied-sql.cs.colorado.edu:3306/maod6844
10 rows affected.

[('ZombieCats', 0, 1214, 1428),
 ('Zed Run', 0, 1215, 1381),
 ('Xpansion', 0, 1216, 1479),
 ('Wrapped Strikers', 0, 1217, 1304),
 ('Wrapped Cryptocats', 0, 1218, 1557),
 ('World Poker Tour', 0, 1219, 1304),
 ('World Of Women', 0, 1220, 1236),
 ('Wolf Game', 0, 1221, 1781),
 ('Winter Bears', 0, 1222, 1827),
 ('Weird Whales', 0, 1223, 1108)]

#### CTE Query to show Mint and Transfer Value

In [17]:
%%sql
with 
    t1(collection, mintTo, mintFrom, mintValue, transferTo, transferValue)
    as (SELECT Art.collection, Mint.from_address , Mint.to_address, Mint.Transaction_value, Transfer.to_address, Transfer.Transaction_value
        from project_transfers as Transfer, project_mints as Mint, project_nftArt as Art
        where Mint.to_address = Transfer.from_address and Art.cId = Transfer.nft_id
       )
select * from t1
order by mintValue DESC
limit 5;

 * mysql://maod6844:***@applied-sql.cs.colorado.edu:3306/maod6844
5 rows affected.

[('Visitors Of Imma Degen', 0, 1228, 99619, 1486, 228973),
 ('Axie Infinity', 0, 1198, 99324, 1288, 46312),
 ('CryptoFlyz', 0, 1157, 99216, 1553, 63349),
 ('Sorare', 0, 1016, 99211, 1412, 309004),
 ('Green Rabbit', 0, 1104, 98998, 1089, 389184)]

### Triggers

#### Attempt to insert a value that already exists in the ethNftCollectionProject.

In [25]:
%%sql
select * from project_collection
limit 2;

 * mysql://maod6844:***@applied-sql.cs.colorado.edu:3306/maod6844
2 rows affected.

[(1001, '0N1 Force'), (1002, '0xVampire')]

In [27]:
try:
    %sql insert into project_collection values(1002, "Beeple");
    result = %sql select * from project_collection
except Exception as err:
    print("Error", err)
    result = 'Failed - address already exists'
result

 * mysql://maod6844:***@applied-sql.cs.colorado.edu:3306/maod6844
Error (MySQLdb._exceptions.IntegrityError) (1062, "Duplicate entry '1002' for key 'project_collection.PRIMARY'")
[SQL: insert into project_collection values(1002, "Beeple");]
(Background on this error at: https://sqlalche.me/e/14/gkpj)

'Failed - address already exists'

#### Adding a new piece requires adding a mint record and updating the art piece information.

In [28]:
%%sql
select * from project_mints limit 2;

 * mysql://maod6844:***@applied-sql.cs.colorado.edu:3306/maod6844
2 rows affected.

[(4010, 300, 1001, 0, 1214, 63922), (4011, 301, 1002, 0, 1215, 52989)]

In [29]:
%%sql
select * from project_nftArt limit 2;

 * mysql://maod6844:***@applied-sql.cs.colorado.edu:3306/maod6844
2 rows affected.

[(1, 1001, '0N1 Force', '147262453', 6917, 15982, 4217),
 (2, 1002, '0xVampire', '8343143', 6105, 13396, 4281)]

In [30]:
%%sql
drop trigger if exists update_mint_record;
create trigger update_mint_record
after insert on project_collection
for each row
BEGIN
INSERT INTO project_nftArt
VALUES(300, new.addId, new.name, 63000000, 1, 1, 1);
INSERT INTO project_mints
VALUES(5001, 401, new.addId, 0, NULL, 63000000);
END;

 * mysql://maod6844:***@applied-sql.cs.colorado.edu:3306/maod6844
0 rows affected.
0 rows affected.

[]

#### Insert into project_collection & Display the cascade result of the insert from the trigger created above

In [31]:
%%sql
INSERT INTO project_collection VALUES(10001, "Beeple");

 * mysql://maod6844:***@applied-sql.cs.colorado.edu:3306/maod6844
1 rows affected.

[]

In [32]:
%%sql
SELECT * from project_nftArt
where cId = 10001;

 * mysql://maod6844:***@applied-sql.cs.colorado.edu:3306/maod6844
1 rows affected.

[(300, 10001, 'Beeple', '63000000', 1, 1, 1)]

In [33]:
%%sql
SELECT * from project_mints
where nft_id = 10001;

 * mysql://maod6844:***@applied-sql.cs.colorado.edu:3306/maod6844
1 rows affected.

[(5001, 401, 10001, 0, None, 63000000)]

### Deletion of an Address ID

#### Delete an address ID from the ethNftCollectionProject will cascade changes in all tables that reference that ID as a foreign key.

In [34]:
%%sql
DELETE FROM project_collection where addId = 1001;

 * mysql://maod6844:***@applied-sql.cs.colorado.edu:3306/maod6844
1 rows affected.

[]

#### Updated Tables

In [35]:
%%sql
SELECT * from project_collection
limit 5;

 * mysql://maod6844:***@applied-sql.cs.colorado.edu:3306/maod6844
5 rows affected.

[(1002, '0xVampire'),
 (1003, '888 Inner Circle'),
 (1004, 'Adam Bomb Squad'),
 (1005, 'Al Cabones'),
 (1006, 'Alien Worlds')]

In [117]:
%%sql
SELECT pId, aId, collection, piece from project_pieces, project_collection
where nftPieces.aId = ethNftCollectionProject.addId
order by aId ASC
limit 5;

 * mysql://maod6844:***@applied-sql.cs.colorado.edu:3306/maod6844
5 rows affected.

[(2, 1002, '0xVampire', 'Giant Frog'),
 (252, 1002, '0xVampire', 'silence'),
 (502, 1002, '0xVampire', 'Rear Window now'),
 (3, 1003, '888 Inner Circle', 'Biospecimens'),
 (253, 1003, '888 Inner Circle', 'Adrenaline')]

In [36]:
%%sql
SELECT cId, collection, sales, buyers, transactions, owners from project_nftArt, project_collection
where project_nftArt.cId = project_collection.addId
limit 5;

 * mysql://maod6844:***@applied-sql.cs.colorado.edu:3306/maod6844
5 rows affected.

[(1002, '0xVampire', '8343143', 6105, 13396, 4281),
 (1003, '888 Inner Circle', '49408610', 5040, 9423, 1),
 (1004, 'Adam Bomb Squad', '40193328', 8774, 23440, 7958),
 (1005, 'Al Cabones', '2956652', 1520, 4243, 3635),
 (1006, 'Alien Worlds', '33282729', 405975, 4630191, 2562646)]

In [37]:
%%sql
SELECT * from project_mints
ORDER BY nft_id ASC
limit 5;

 * mysql://maod6844:***@applied-sql.cs.colorado.edu:3306/maod6844
5 rows affected.

[(4011, 301, 1002, 0, 1215, 52989),
 (4012, 302, 1003, 0, 1216, 73485),
 (4013, 303, 1004, 0, 1217, 95808),
 (4014, 304, 1005, 0, 1218, 9725),
 (4015, 305, 1006, 0, 1219, 75384)]

In [38]:
%%sql
SELECT * from project_transfers
ORDER BY nft_id ASC
limit 5;

 * mysql://maod6844:***@applied-sql.cs.colorado.edu:3306/maod6844
5 rows affected.

[(6248, 748, 1002, 1212, 1568, 19440),
 (6247, 747, 1003, 1211, 1598, 69531),
 (6246, 746, 1004, 1210, 1377, 33557),
 (6245, 745, 1005, 1209, 1100, 53475),
 (6244, 744, 1006, 1208, 1871, 5395)]